### Merge e consultas usando Python

- Esse script vai trazer quatro tabelas.
- São elas: CLIENTES / VENDEDORES / PRODUTOS / VENDAS.
- A ideia é criar um merge entre elas para visualizar melhor as informações. 
- No final, trago três consultas básicas com informações de nossos dados.

In [ ]:
import pandas as pd

In [57]:
df_clientes = pd.read_csv('Tabela 1 - clientes.csv')
df_vendedores = pd.read_csv('Tabela 2 - vendedores.csv')
df_produtos = pd.read_csv('Tabela 3 - produtos.csv')
df_vendas = pd.read_csv('Tabela 4 - vendas.csv')

In [58]:
df_vendas.head()

   ID_VENDA  ID_CLIENTE  ID_VENDEDOR  ID_PRODUTO  QUANTIDADE  DATA_VENDA
0         1        1154            4        7751          24  2023-01-02
1         2        3206            6        8851          23  2023-01-04
2         3        1045            1        7750          72  2023-01-06
3         4        4788            7        8851          25  2023-01-09
4         5        1154            8        8851          24  2023-01-11

In [59]:
df_vendas_clientes = pd.merge(df_vendas, df_clientes, on='ID_CLIENTE')
df_vendas_clientes.head()

,ID_VENDA,ID_CLIENTE,ID_VENDEDOR,ID_PRODUTO,QUANTIDADE,DATA_VENDA,NOME_CLIENTE,CIDADE
0,1,1154,4,7751,24,2023-01-02,Seven T.,WS City
1,5,1154,8,8851,24,2023-01-11,Seven T.,WS City
2,10,1154,8,8850,80,2023-01-17,Seven T.,WS City
3,13,1154,4,7750,84,2023-01-23,Seven T.,WS City
4,15,1154,8,8851,28,2023-01-30,Seven T.,WS City

In [60]:
df_vc_produtos = pd.merge(df_vendas_clientes, df_produtos, on='ID_PRODUTO')
df_vc_produtos.head()

,ID_VENDA,ID_CLIENTE,ID_VENDEDOR,ID_PRODUTO,QUANTIDADE,DATA_VENDA,NOME_CLIENTE,CIDADE,PRODUTO,FORNECEDOR,VALOR_PRODUTO
0,1,1154,4,7751,24,2023-01-02,Seven T.,WS City,Clow N VV2,Brand New Clow,154.0
1,42,1154,4,7751,30,2023-03-06,Seven T.,WS City,Clow N VV2,Brand New Clow,154.0
2,48,1154,4,7751,30,2023-03-11,Seven T.,WS City,Clow N VV2,Brand New Clow,154.0
3,8,3206,2,7751,63,2023-01-14,Lefbronx,WS City,Clow N VV2,Brand New Clow,154.0
4,40,3206,2,7751,85,2023-03-04,Lefbronx,WS City,Clow N VV2,Brand New Clow,154.0

In [61]:
df_vcp_vendedores = pd.merge(df_vc_produtos, df_vendedores, on='ID_VENDEDOR')
df_vcp_vendedores.head()

,ID_VENDA,ID_CLIENTE,ID_VENDEDOR,ID_PRODUTO,QUANTIDADE,DATA_VENDA,NOME_CLIENTE,CIDADE,PRODUTO,FORNECEDOR,VALOR_PRODUTO,NOME_VENDEDOR
0,1,1154,4,7751,24,2023-01-02,Seven T.,WS City,Clow N VV2,Brand New Clow,154.0,Xuano
1,42,1154,4,7751,30,2023-03-06,Seven T.,WS City,Clow N VV2,Brand New Clow,154.0,Xuano
2,48,1154,4,7751,30,2023-03-11,Seven T.,WS City,Clow N VV2,Brand New Clow,154.0,Xuano
3,13,1154,4,7750,84,2023-01-23,Seven T.,WS City,New C. Balac,Brand New Clow,89.0,Xuano
4,31,1154,4,7750,92,2023-02-21,Seven T.,WS City,New C. Balac,Brand New Clow,89.0,Xuano

In [62]:
df_geral_nomes = df_vcp_vendedores[['DATA_VENDA', 'NOME_CLIENTE', 'CIDADE', 'NOME_VENDEDOR', 'FORNECEDOR', 'PRODUTO', 'QUANTIDADE', 'VALOR_PRODUTO']]
df_geral_nomes.head()

,DATA_VENDA,NOME_CLIENTE,CIDADE,NOME_VENDEDOR,FORNECEDOR,PRODUTO,QUANTIDADE,VALOR_PRODUTO
0,2023-01-02,Seven T.,WS City,Xuano,Brand New Clow,Clow N VV2,24,154.0
1,2023-03-06,Seven T.,WS City,Xuano,Brand New Clow,Clow N VV2,30,154.0
2,2023-03-11,Seven T.,WS City,Xuano,Brand New Clow,Clow N VV2,30,154.0
3,2023-01-23,Seven T.,WS City,Xuano,Brand New Clow,New C. Balac,84,89.0
4,2023-02-21,Seven T.,WS City,Xuano,Brand New Clow,New C. Balac,92,89.0

In [63]:
df_geral_nomes = df_geral_nomes.copy() 
df_geral_nomes['VALOR_TOTAL_VENDA'] = df_geral_nomes['QUANTIDADE'] * df_geral_nomes['VALOR_PRODUTO']
df_geral_nomes.head()

,DATA_VENDA,NOME_CLIENTE,CIDADE,NOME_VENDEDOR,FORNECEDOR,PRODUTO,QUANTIDADE,VALOR_PRODUTO,VALOR_TOTAL_VENDA
0,2023-01-02,Seven T.,WS City,Xuano,Brand New Clow,Clow N VV2,24,154.0,3696.0
1,2023-03-06,Seven T.,WS City,Xuano,Brand New Clow,Clow N VV2,30,154.0,4620.0
2,2023-03-11,Seven T.,WS City,Xuano,Brand New Clow,Clow N VV2,30,154.0,4620.0
3,2023-01-23,Seven T.,WS City,Xuano,Brand New Clow,New C. Balac,84,89.0,7476.0
4,2023-02-21,Seven T.,WS City,Xuano,Brand New Clow,New C. Balac,92,89.0,8188.0

### Três informações relevantes

#### 1. Qual cliente mais comprou?

In [64]:
cliente_mais_comprou = df_geral_nomes.groupby('NOME_CLIENTE').sum(numeric_only=True).drop(['QUANTIDADE', 'VALOR_PRODUTO'], axis=1)
cliente_mais_comprou.sort_values('VALOR_TOTAL_VENDA', ascending=False)

              VALOR_TOTAL_VENDA
NOME_CLIENTE
Lefbronx               137378.0
Chauri Moon            132391.0
Cardon One              74841.0
Seven T.                71966.0

#### 2. Qual produto mais vendido?

In [65]:
produto_mais_vendido = df_geral_nomes.groupby('PRODUTO').sum(numeric_only=True).drop(['QUANTIDADE', 'VALOR_PRODUTO'], axis=1)
produto_mais_vendido['FORNECEDOR'] = df_geral_nomes.groupby('PRODUTO')['FORNECEDOR'].first()
produto_mais_vendido.sort_values('VALOR_TOTAL_VENDA', ascending=False)

              VALOR_TOTAL_VENDA      FORNECEDOR
PRODUTO
Clow N VV2             134288.0  Brand New Clow
Shirt Pac 10           118260.0        Pac Tren
Basic Pac X             84373.0        Pac Tren
New C. Balac            79655.0  Brand New Clow

#### 3. Qual vendedor mais vendeu?

In [68]:
melhor_vendedor = df_geral_nomes.groupby('NOME_VENDEDOR').sum(numeric_only=True).drop(['QUANTIDADE', 'VALOR_PRODUTO'], axis=1)
melhor_vendedor.sort_values('VALOR_TOTAL_VENDA', ascending=False)

               VALOR_TOTAL_VENDA
NOME_VENDEDOR
Duain                    87911.0
Agron                    73255.0
Nekie                    59136.0
Faldek                   49467.0
Isfim                    43440.0
Firon                    40518.0
Xuano                    31448.0
Mufi                     31401.0